from pygame import *
game_map = [
    # 1    2    3    4   5     6    7   8    9   10   11   12   13   14    15
    ['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A'],
    ['A', "_", "_", "_", "A", "_", "_", "_", "_", "A", "_", "A", "A", "_", 'A'],
    ['A', "A", "A", "_", "A", "_", "A", "_", "A", "A", "_", "_", "A", "_", 'A'],
    ['A', "_", "A", "_", "A", "A", "A", "_", "_", "A", "_", "A", "A", "_", 'A'],
    ['A', "_", "_", "_", "A", "_", "_", "-", "A", "A", "_", "_", "_", "A", 'A'],
    ['A', "_", "A", "A", "A", "A", "A", "_", "_", "A", "A", "_", "_", "_", 'A'],
    ['A', "_", "A", "_", "A", "_", "A", "_", "_", "_", "_", "_", "A", "A", 'A'],
    ['A', "_", "_", "-", "A", "_", "A", "A", "A", "_", "A", "_", "_", "_", 'A'],
    ['A', "_", "A", "_", "_", "_", "_", "A", "_", "_", "A", "_", "A", "_", 'A'],
    ['A', "_", "A", "A", "A", "_", "_", "_", "_", "A", "A", "_", "A", "A", 'A'],
    ['A', "_", "A", "_", "_", "_", "_", "A", "A", "A", "_", "_", "A", "A", 'A'],
    ['A', "_", "A", "A", "A", "A", "_", "A", "_", "_", "_", "A", "A", "_", 'A'],
    ['A', "_", "_", "_", "_", "A", "_", "A", "A", "A", "_", "_", "_", "_", 'A'],
    ['A', "A", "_", "A", "_", "_", "_", "_", "_", "A", "A", "_", "_", "_", 'A'],
    ['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A'],
]
class Block:

    def __init__ (self, color, x, y, width, height):
        self.color = color
        self.rect = Rect(x, y, width, height)
    # функція, яка за потреби буде рухати персонажа
    def draw(self, window):
        draw.rect(window, self.color, self.rect)

def make_map():
    SIZE = 795 / 15  # розмір квадратика 1/15 вікна
    ryadok = game_map[0] # взяв рядок
    result = []
    y = 0
    for i in range(len(game_map)):
        ryadok = game_map[i]  # взяв рядок
        x = 0
    # наповнюємо список результату
        for block in ryadok:
            if block == "A":
                # створюємо прямокутник у вікні
                new_block = Block((0, 255, 0), (x), y, SIZE, SIZE)
                result.append(new_block) # додати об'єкт-блок до списку
            x += SIZE
        y += SIZE
    return result